---
kind: method
id: M:Autodesk.Revit.DB.RelinquishOptions.Dispose
source: html/b34aef29-a25f-fa94-70ef-f8eeefa31f28.htm
---
# Autodesk.Revit.DB.RelinquishOptions.Dispose Method

Releases all resources used by the RelinquishOptions

## Syntax (C#)
```csharp
public void Dispose()
```